#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/benjo-learns/ECS-Mess/runs/run-bUmkATDhPszSHFhu

Waiting for the plan to start...

Terraform v1.9.1
on linux_amd64
Initializing plugins and modules...
random_password.custom_header: Refreshing state... [id=none]
aws_acm_certificate.wildcard-cloudfront: Refreshing state... [id=arn:aws:acm:us-east-1:906273274991:certificate/3f16c14c-76db-47c4-8ad9-0cffecf7f09f]
aws_security_group_rule.alb_cloudfront_ingress_temp: Refreshing state... [id=sgrule-803045949]
aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-0929c079492b6600a]
aws_ecs_cluster.testApp01: Refreshing state... [id=arn:aws:ecs:eu-west-1:906273274991:cluster/testApp01-ecs-cluster]
data.aws_route53_zone.hosted_zone: Refreshing...
data.aws_ec2_managed_prefix_list.cloudfront: Refreshing...
aws_ecs_task_definition.api: Refreshing state... [id=api-task]
aws_s3_bucket.testApp01-bucket: Refreshing state... [id=hello-from.bengreen.xyz]
data.aws_availability_zones.available: Refreshing...
data.aws_ami.ecs_ami: Refreshing...
aws_cloudfront_origin_access_control.testApp01: Refreshing state... [id=E1FY1UZQ7FWET6]
aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-048f202f7890991ce]
data.aws_route53_zone.hosted_zone: Refresh complete after 0s [id=Z24PAP3F92A4NR]
aws_vpc.testApp01-vpc: Refreshing state... [id=vpc-0594176384ecfe77a]
aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-000090d0d256374f8]
aws_acm_certificate.wildcard-backend: Refreshing state... [id=arn:aws:acm:eu-west-1:906273274991:certificate/4a105844-2fd5-468f-92e7-e4db8d077eaf]
aws_kms_key.kms-fors3-encrypt: Refreshing state... [id=606c6ad1-76d3-4ddc-9ea2-6c0190648f63]
data.aws_availability_zones.available: Refresh complete after 0s [id=eu-west-1]
aws_iam_role.ecs_instance_role: Refreshing state... [id=ecs_instance_role]
aws_acm_certificate.wildcard-lb: Refreshing state... [id=arn:aws:acm:eu-west-1:906273274991:certificate/06df78d9-73ab-46c7-9f28-e1107b382878]
aws_route53_record.cert-validation-cloudfront["*.hello-from.bengreen.xyz"]: Refreshing state... [id=Z24PAP3F92A4NR__a20af4e801d36895d730b4eb1bf205e1.hello-from.bengreen.xyz._CNAME]
aws_route53_record.cert-validation-cloudfront["hello-from.bengreen.xyz"]: Refreshing state... [id=Z24PAP3F92A4NR__a20af4e801d36895d730b4eb1bf205e1.hello-from.bengreen.xyz._CNAME]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5OMZZBN40UGN]
aws_s3_object.object["index.html"]: Refreshing state... [id=site-content/index.html]
aws_iam_role_policy_attachment.ecs_instance_role: Refreshing state... [id=ecs_instance_role-20240703202234798600000003]
data.aws_ami.ecs_ami: Refresh complete after 0s [id=ami-0f05eaa1022048fb9]
aws_iam_instance_profile.ecs_instance_profile: Refreshing state... [id=ecs_instance_profile]
data.aws_ec2_managed_prefix_list.cloudfront: Refresh complete after 0s [id=pl-4fa04526]
aws_internet_gateway.internet-gw: Refreshing state... [id=igw-046e152deb550b6b9]
aws_default_security_group.default: Refreshing state... [id=sg-0c48bb46a8229d95a]
aws_subnet.public[1]: Refreshing state... [id=subnet-04e869c1db91655a2]
aws_subnet.public[2]: Refreshing state... [id=subnet-06450fd06929c67a7]
aws_subnet.public[0]: Refreshing state... [id=subnet-0db2bdb84e5012452]
aws_subnet.private[2]: Refreshing state... [id=subnet-0bd05d832c02712c0]
aws_subnet.private[0]: Refreshing state... [id=subnet-0a9f778b8c0dc0921]
aws_subnet.private[1]: Refreshing state... [id=subnet-0543a924273051fd6]
aws_security_group.lb_sg: Refreshing state... [id=sg-01e8c55b1a1e7ab64]
aws_route53_record.cloudfront-domain: Refreshing state... [id=Z24PAP3F92A4NR_hello-from.bengreen.xyz_A]
aws_acm_certificate_validation.cert-validation-cloudfront: Refreshing state... [id=2024-07-03 20:22:53.799 +0000 UTC]
aws_s3_bucket_server_side_encryption_configuration.s3-sse-encrypt: Refreshing state... [id=hello-from.bengreen.xyz]
aws_kms_key_policy.cloudfront-grant: Refreshing state... [id=606c6ad1-76d3-4ddc-9ea2-6c0190648f63]
aws_route53_record.cert-validation-lb["*.backend.bengreen.xyz"]: Refreshing state... [id=Z24PAP3F92A4NR__17eae769a297442cd8ae5c954e77a932.backend.bengreen.xyz._CNAME]
aws_route53_record.cert-validation-lb["backend.bengreen.xyz"]: Refreshing state... [id=Z24PAP3F92A4NR__17eae769a297442cd8ae5c954e77a932.backend.bengreen.xyz._CNAME]
aws_route_table.internet-access-rt: Refreshing state... [id=rtb-0cd81af8ac65f4f49]
aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=hello-from.bengreen.xyz]
aws_nat_gateway.nat_gateway[2]: Refreshing state... [id=nat-0690c3080a7b58a93]
aws_nat_gateway.nat_gateway[0]: Refreshing state... [id=nat-05ac9ede8ed6465dd]
aws_acm_certificate_validation.cert-validation-alb: Refreshing state... [id=2024-07-03 20:22:53.441 +0000 UTC]
aws_nat_gateway.nat_gateway[1]: Refreshing state... [id=nat-0a006d7bff9fc6574]
aws_security_group_rule.alb_cloudfront_https_ingress_only: Refreshing state... [id=sgrule-2804138692]
aws_security_group.ecs_sg: Refreshing state... [id=sg-0a281f3d64f41fdde]
aws_lb.ecs_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:906273274991:loadbalancer/app/ecs-lb/6a9d413f1fd0edde]
aws_route_table_association.public_subnet_assoc[1]: Refreshing state... [id=rtbassoc-016e85b719e6695de]
aws_route_table_association.public_subnet_assoc[2]: Refreshing state... [id=rtbassoc-0c64c77889022cce3]
aws_route_table_association.public_subnet_assoc[0]: Refreshing state... [id=rtbassoc-03bbde36f389434d5]
aws_route53_record.alb-domain: Refreshing state... [id=Z24PAP3F92A4NR_backend.bengreen.xyz_A]
aws_lb_listener.alb_default_listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:906273274991:listener/app/ecs-lb/6a9d413f1fd0edde/1b51f066addb72ca]
aws_lb_target_group.service_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:906273274991:targetgroup/testApp01-TargetGroup-dev/4ac33bce592a109a]
aws_launch_template.ecs_instance: Refreshing state... [id=lt-0e296b500f2ed71ec]
aws_autoscaling_group.ecs_instances: Refreshing state... [id=terraform-20240703202244487000000007]
aws_lb_listener_rule.https_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:906273274991:listener-rule/app/ecs-lb/6a9d413f1fd0edde/1b51f066addb72ca/04f62e4ab19ad2d3]
aws_ecs_service.api_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:906273274991:service/testApp01-ecs-cluster/api-service]
aws_lb_listener.alb_default_listener_https: Drift detected (delete)
aws_vpc.testApp01-vpc: Drift detected (delete)
aws_lb.ecs_lb: Drift detected (delete)
aws_route_table_association.public_subnet_assoc[0]: Drift detected (delete)
aws_route_table_association.public_subnet_assoc[1]: Drift detected (delete)
aws_route_table_association.public_subnet_assoc[2]: Drift detected (delete)
aws_autoscaling_group.ecs_instances: Drift detected (delete)
aws_acm_certificate_validation.cert-validation-alb: Drift detected (delete)
aws_s3_object.object["index.html"]: Drift detected (delete)
aws_subnet.private[0]: Drift detected (delete)
aws_subnet.private[1]: Drift detected (delete)
aws_subnet.private[2]: Drift detected (delete)
aws_acm_certificate.wildcard-cloudfront: Drift detected (delete)
aws_ecs_cluster.testApp01: Drift detected (delete)
aws_eip.nat_gateway[1]: Drift detected (delete)
aws_eip.nat_gateway[2]: Drift detected (delete)
aws_eip.nat_gateway[0]: Drift detected (delete)
aws_route53_record.cloudfront-domain: Drift detected (delete)
aws_subnet.public[0]: Drift detected (delete)
aws_subnet.public[1]: Drift detected (delete)
aws_subnet.public[2]: Drift detected (delete)
aws_cloudfront_origin_access_control.testApp01: Drift detected (delete)
aws_acm_certificate.wildcard-backend: Drift detected (delete)
aws_lb_listener_rule.https_listener_rule: Drift detected (delete)
aws_iam_instance_profile.ecs_instance_profile: Drift detected (delete)
aws_security_group_rule.alb_cloudfront_https_ingress_only: Drift detected (delete)
aws_nat_gateway.nat_gateway[2]: Drift detected (delete)
aws_nat_gateway.nat_gateway[0]: Drift detected (delete)
aws_nat_gateway.nat_gateway[1]: Drift detected (delete)
aws_internet_gateway.internet-gw: Drift detected (delete)
aws_default_security_group.default: Drift detected (delete)
aws_ecs_task_definition.api: Drift detected (delete)
aws_cloudfront_distribution.s3_distribution: Drift detected (delete)
aws_iam_role.ecs_instance_role: Drift detected (delete)
aws_ecs_service.api_service: Drift detected (delete)
aws_security_group.lb_sg: Drift detected (delete)
aws_s3_bucket_server_side_encryption_configuration.s3-sse-encrypt: Drift detected (delete)
aws_route53_record.cert-validation-lb["backend.bengreen.xyz"]: Drift detected (delete)
aws_route53_record.cert-validation-lb["*.backend.bengreen.xyz"]: Drift detected (delete)
aws_kms_key_policy.cloudfront-grant: Drift detected (delete)
aws_acm_certificate.wildcard-lb: Drift detected (delete)
aws_launch_template.ecs_instance: Drift detected (delete)
aws_route53_record.alb-domain: Drift detected (delete)
aws_acm_certificate_validation.cert-validation-cloudfront: Drift detected (delete)
aws_route53_record.cert-validation-cloudfront["*.hello-from.bengreen.xyz"]: Drift detected (delete)
aws_route53_record.cert-validation-cloudfront["hello-from.bengreen.xyz"]: Drift detected (delete)
aws_lb_target_group.service_target_group: Drift detected (delete)
aws_route_table.internet-access-rt: Drift detected (delete)
aws_kms_key.kms-fors3-encrypt: Drift detected (delete)
aws_security_group.ecs_sg: Drift detected (delete)
aws_s3_bucket_policy.bucket_policy: Drift detected (delete)
aws_security_group_rule.alb_cloudfront_ingress_temp: Drift detected (delete)
aws_s3_bucket.testApp01-bucket: Drift detected (delete)
aws_iam_role_policy_attachment.ecs_instance_role: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_acm_certificate.wildcard-backend has been deleted
  - resource "aws_acm_certificate" "wildcard-backend" {
      - domain_validation_options = [
          - {
              - domain_name           = "*.backend.bengreen.xyz"
              - resource_record_name  = "_17eae769a297442cd8ae5c954e77a932.backend.bengreen.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_63defbfc9798913b502abc99d9ec7105.sdgjtdhdhz.acm-validations.aws."
            },
          - {
              - domain_name           = "backend.bengreen.xyz"
              - resource_record_name  = "_17eae769a297442cd8ae5c954e77a932.backend.bengreen.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_63defbfc9798913b502abc99d9ec7105.sdgjtdhdhz.acm-validations.aws."
            },
        ] -> null
        id                        = "arn:aws:acm:eu-west-1:906273274991:certificate/4a105844-2fd5-468f-92e7-e4db8d077eaf"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.wildcard-cloudfront has been deleted
  - resource "aws_acm_certificate" "wildcard-cloudfront" {
      - arn                       = "arn:aws:acm:us-east-1:906273274991:certificate/3f16c14c-76db-47c4-8ad9-0cffecf7f09f" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.hello-from.bengreen.xyz"
              - resource_record_name  = "_a20af4e801d36895d730b4eb1bf205e1.hello-from.bengreen.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_7a3bca7d485f5693b08f46be16f3eeed.sdgjtdhdhz.acm-validations.aws."
            },
          - {
              - domain_name           = "hello-from.bengreen.xyz"
              - resource_record_name  = "_a20af4e801d36895d730b4eb1bf205e1.hello-from.bengreen.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_7a3bca7d485f5693b08f46be16f3eeed.sdgjtdhdhz.acm-validations.aws."
            },
        ] -> null
        id                        = "arn:aws:acm:us-east-1:906273274991:certificate/3f16c14c-76db-47c4-8ad9-0cffecf7f09f"
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate.wildcard-lb has been deleted
  - resource "aws_acm_certificate" "wildcard-lb" {
      - arn                       = "arn:aws:acm:eu-west-1:906273274991:certificate/06df78d9-73ab-46c7-9f28-e1107b382878" -> null
        id                        = "arn:aws:acm:eu-west-1:906273274991:certificate/06df78d9-73ab-46c7-9f28-e1107b382878"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudfront_distribution.s3_distribution has been deleted
  - resource "aws_cloudfront_distribution" "s3_distribution" {
      - arn                             = "arn:aws:cloudfront::906273274991:distribution/E5OMZZBN40UGN" -> null
      - domain_name                     = "d1cktjgrv4a6lf.cloudfront.net" -> null
      - hosted_zone_id                  = "Z2FDTNDATAQYW2" -> null
        id                              = "E5OMZZBN40UGN"
        # (20 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_control.testApp01 has been deleted
  - resource "aws_cloudfront_origin_access_control" "testApp01" {
      - id                                = "E1FY1UZQ7FWET6" -> null
        name                              = "testApp01"
        # (5 unchanged attributes hidden)
    }

  # aws_ecs_cluster.testApp01 has been deleted
  - resource "aws_ecs_cluster" "testApp01" {
      - id       = "arn:aws:ecs:eu-west-1:906273274991:cluster/testApp01-ecs-cluster" -> null
      - name     = "testApp01-ecs-cluster" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_task_definition.api has been deleted
  - resource "aws_ecs_task_definition" "api" {
      - arn                      = "arn:aws:ecs:eu-west-1:906273274991:task-definition/api-task:9" -> null
        id                       = "api-task"
        # (15 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.ecs_instance_profile has been deleted
  - resource "aws_iam_instance_profile" "ecs_instance_profile" {
        id          = "ecs_instance_profile"
      - name        = "ecs_instance_profile" -> null
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.ecs_instance_role has been deleted
  - resource "aws_iam_role" "ecs_instance_role" {
        id                    = "ecs_instance_role"
      - name                  = "ecs_instance_role" -> null
        # (12 unchanged attributes hidden)
    }

  # aws_internet_gateway.internet-gw has been deleted
  - resource "aws_internet_gateway" "internet-gw" {
      - id       = "igw-046e152deb550b6b9" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_kms_key.kms-fors3-encrypt has been deleted
  - resource "aws_kms_key" "kms-fors3-encrypt" {
      - arn                                = "arn:aws:kms:eu-west-1:906273274991:key/606c6ad1-76d3-4ddc-9ea2-6c0190648f63" -> null
        id                                 = "606c6ad1-76d3-4ddc-9ea2-6c0190648f63"
      - key_id                             = "606c6ad1-76d3-4ddc-9ea2-6c0190648f63" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_launch_template.ecs_instance has been deleted
  - resource "aws_launch_template" "ecs_instance" {
      - id                                   = "lt-0e296b500f2ed71ec" -> null
        name                                 = "ecs-instance-template"
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lb.ecs_lb has been deleted
  - resource "aws_lb" "ecs_lb" {
      - arn                                                          = "arn:aws:elasticloadbalancing:eu-west-1:906273274991:loadbalancer/app/ecs-lb/6a9d413f1fd0edde" -> null
      - dns_name                                                     = "ecs-lb-1900700893.eu-west-1.elb.amazonaws.com" -> null
        id                                                           = "arn:aws:elasticloadbalancing:eu-west-1:906273274991:loadbalancer/app/ecs-lb/6a9d413f1fd0edde"
        name                                                         = "ecs-lb"
      - zone_id                                                      = "Z32O12XQLNTSW2" -> null
        # (23 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lb_listener.alb_default_listener_https has been deleted
  - resource "aws_lb_listener" "alb_default_listener_https" {
      - arn               = "arn:aws:elasticloadbalancing:eu-west-1:906273274991:listener/app/ecs-lb/6a9d413f1fd0edde/1b51f066addb72ca" -> null
        id                = "arn:aws:elasticloadbalancing:eu-west-1:906273274991:listener/app/ecs-lb/6a9d413f1fd0edde/1b51f066addb72ca"
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.service_target_group has been deleted
  - resource "aws_lb_target_group" "service_target_group" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:906273274991:targetgroup/testApp01-TargetGroup-dev/4ac33bce592a109a" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:906273274991:targetgroup/testApp01-TargetGroup-dev/4ac33bce592a109a"
        name                               = "testApp01-TargetGroup-dev"
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_route_table.internet-access-rt has been deleted
  - resource "aws_route_table" "internet-access-rt" {
      - id               = "rtb-0cd81af8ac65f4f49" -> null
        # (6 unchanged attributes hidden)
    }

  # aws_s3_bucket.testApp01-bucket has been deleted
  - resource "aws_s3_bucket" "testApp01-bucket" {
      - arn                         = "arn:aws:s3:::hello-from.bengreen.xyz" -> null
      - bucket_regional_domain_name = "hello-from.bengreen.xyz.s3.eu-west-1.amazonaws.com" -> null
      - id                          = "hello-from.bengreen.xyz" -> null
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_security_group.ecs_sg has been deleted
  - resource "aws_security_group" "ecs_sg" {
      - id                     = "sg-0a281f3d64f41fdde" -> null
        name                   = "ecs-sg20240703202237680700000005"
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.lb_sg has been deleted
  - resource "aws_security_group" "lb_sg" {
      - id                     = "sg-01e8c55b1a1e7ab64" -> null
        name                   = "lb-sg"
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - id                                             = "subnet-0a9f778b8c0dc0921" -> null
        tags                                           = {
            "Name" = "PrivateSubnet 1"
        }
        # (20 unchanged attributes hidden)
    }

  # aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - id                                             = "subnet-0543a924273051fd6" -> null
        tags                                           = {
            "Name" = "PrivateSubnet 2"
        }
        # (20 unchanged attributes hidden)
    }

  # aws_vpc.testApp01-vpc has been deleted
  - resource "aws_vpc" "testApp01-vpc" {
      - id                                   = "vpc-0594176384ecfe77a" -> null
        # (19 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.bucket_policy will be read during apply
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudFrontServicePrincipal"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.wildcard-backend will be created
  + resource "aws_acm_certificate" "wildcard-backend" {
      + arn                       = (known after apply)
      + domain_name               = "backend.bengreen.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.backend.bengreen.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "backend.bengreen.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.backend.bengreen.xyz",
          + "backend.bengreen.xyz",
        ]
      + tags_all                  = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate.wildcard-cloudfront will be created
  + resource "aws_acm_certificate" "wildcard-cloudfront" {
      + arn                       = (known after apply)
      + domain_name               = "hello-from.bengreen.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.hello-from.bengreen.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "hello-from.bengreen.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.hello-from.bengreen.xyz",
          + "hello-from.bengreen.xyz",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate.wildcard-lb will be created
  + resource "aws_acm_certificate" "wildcard-lb" {
      + arn                       = (known after apply)
      + domain_name               = "backend.bengreen.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.backend.bengreen.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "backend.bengreen.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.backend.bengreen.xyz",
          + "backend.bengreen.xyz",
        ]
      + tags_all                  = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.cert-validation-alb will be created
  + resource "aws_acm_certificate_validation" "cert-validation-alb" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.cert-validation-cloudfront will be created
  + resource "aws_acm_certificate_validation" "cert-validation-cloudfront" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_autoscaling_group.ecs_instances will be created
  + resource "aws_autoscaling_group" "ecs_instances" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "testApp01-ecs-cluster"
          + propagate_at_launch = true
          + value               = "ECS Instance"
        }

      + traffic_source (known after apply)
    }

  # aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                         = [
          + "hello-from.bengreen.xyz",
          + "www.hello-from.bengreen.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "testApp01 CDN"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "testApp01-s3origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "testApp01-s3origin"
          + origin_path              = "/site-content"
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "GB",
                ]
              + restriction_type = "whitelist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_control.testApp01 will be created
  + resource "aws_cloudfront_origin_access_control" "testApp01" {
      + description                       = "Access KMS encrypted S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "testApp01"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = true
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ecr_repository.ecr_repo will be created
  + resource "aws_ecr_repository" "ecr_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "test-repo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.testApp01 will be created
  + resource "aws_ecs_cluster" "testApp01" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "testApp01-ecs-cluster"
      + tags_all = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }

      + setting (known after apply)
    }

  # aws_ecs_service.api_service will be created
  + resource "aws_ecs_service" "api_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "EC2"
      + name                               = "api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "test-container"
          + container_port   = 8000
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.api will be created
  + resource "aws_ecs_task_definition" "api" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential    = true
                  + image        = "906273274991.dkr.ecr.eu-west-1.amazonaws.com/test-repo:fast-api-2024-07-03"
                  + name         = "test-container"
                  + portMappings = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 8000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + family                   = "api-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "EC2",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + track_latest             = false
    }

  # aws_eip.nat_gateway[0] will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat_gateway[1] will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat_gateway[2] will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc                  = (known after apply)
    }

  # aws_iam_instance_profile.ecs_instance_profile will be created
  + resource "aws_iam_instance_profile" "ecs_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ecs_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ecs_instance_role"
      + tags_all    = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ecs_instance_role will be created
  + resource "aws_iam_role" "ecs_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_instance_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "ecs_instance_role"
    }

  # aws_internet_gateway.internet-gw will be created
  + resource "aws_internet_gateway" "internet-gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_key.kms-fors3-encrypt will be created
  + resource "aws_kms_key" "kms-fors3-encrypt" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "Key for SSE "
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
    }

  # aws_kms_key_policy.cloudfront-grant will be created
  + resource "aws_kms_key_policy" "cloudfront-grant" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_launch_template.ecs_instance will be created
  + resource "aws_launch_template" "ecs_instance" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-0f05eaa1022048fb9"
      + instance_type   = "t2.micro"
      + latest_version  = (known after apply)
      + name            = "ecs-instance-template"
      + name_prefix     = (known after apply)
      + tags_all        = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + user_data       = "IyEvYmluL2Jhc2gKZWNobyAiRUNTX0NMVVNURVI9dGVzdEFwcDAxLWVjcy1jbHVzdGVyIiA+IC9ldGMvZWNzL2Vjcy5jb25maWcK"

      + iam_instance_profile {
          + name = "ecs_instance_profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "false"
          + device_index                = 0
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "ECS Instance"
            }
        }
    }

  # aws_lb.ecs_lb will be created
  + resource "aws_lb" "ecs_lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ecs-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags_all                                                     = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.alb_default_listener_https will be created
  + resource "aws_lb_listener" "alb_default_listener_https" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-Ext-2018-06"
      + tags_all          = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Access denied"
              + status_code  = "403"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener_rule.https_listener_rule will be created
  + resource "aws_lb_listener_rule" "https_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "backend.bengreen.xyz",
                ]
            }
        }
    }

  # aws_lb_target_group.service_target_group will be created
  + resource "aws_lb_target_group" "service_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "5"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "testApp01-TargetGroup-dev"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_health_state (known after apply)
    }

  # aws_nat_gateway.nat_gateway[0] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "testApp01_NATGateway_0_dev"
        }
      + tags_all                           = {
          + "AppStackID" = "testApp01"
          + "Name"       = "testApp01_NATGateway_0_dev"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
    }

  # aws_nat_gateway.nat_gateway[1] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "testApp01_NATGateway_1_dev"
        }
      + tags_all                           = {
          + "AppStackID" = "testApp01"
          + "Name"       = "testApp01_NATGateway_1_dev"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
    }

  # aws_nat_gateway.nat_gateway[2] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "testApp01_NATGateway_2_dev"
        }
      + tags_all                           = {
          + "AppStackID" = "testApp01"
          + "Name"       = "testApp01_NATGateway_2_dev"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
    }

  # aws_route53_record.alb-domain will be created
  + resource "aws_route53_record" "alb-domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "backend.bengreen.xyz"
      + type            = "A"
      + zone_id         = "Z24PAP3F92A4NR"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.cert-validation-cloudfront["*.hello-from.bengreen.xyz"] will be created
  + resource "aws_route53_record" "cert-validation-cloudfront" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z24PAP3F92A4NR"
    }

  # aws_route53_record.cert-validation-cloudfront["hello-from.bengreen.xyz"] will be created
  + resource "aws_route53_record" "cert-validation-cloudfront" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z24PAP3F92A4NR"
    }

  # aws_route53_record.cert-validation-lb["*.backend.bengreen.xyz"] will be created
  + resource "aws_route53_record" "cert-validation-lb" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z24PAP3F92A4NR"
    }

  # aws_route53_record.cert-validation-lb["backend.bengreen.xyz"] will be created
  + resource "aws_route53_record" "cert-validation-lb" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z24PAP3F92A4NR"
    }

  # aws_route53_record.cloudfront-domain will be created
  + resource "aws_route53_record" "cloudfront-domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hello-from.bengreen.xyz"
      + type            = "A"
      + zone_id         = "Z24PAP3F92A4NR"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route_table.internet-access-rt will be created
  + resource "aws_route_table" "internet-access-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_subnet_assoc[0] will be created
  + resource "aws_route_table_association" "public_subnet_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnet_assoc[1] will be created
  + resource "aws_route_table_association" "public_subnet_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnet_assoc[2] will be created
  + resource "aws_route_table_association" "public_subnet_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.testApp01-bucket will be created
  + resource "aws_s3_bucket" "testApp01-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "hello-from.bengreen.xyz"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_server_side_encryption_configuration.s3-sse-encrypt will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "s3-sse-encrypt" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.versioning_example will be created
  + resource "aws_s3_bucket_versioning" "versioning_example" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_object.object["index.html"] will be created
  + resource "aws_s3_object" "object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "82c755adadd5a711c2f5ad8e584415d2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site-content/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "site-content/index.html"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + version_id             = (known after apply)
    }

  # aws_security_group.ecs_sg will be created
  + resource "aws_security_group" "ecs_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow ingress traffic from ALB to ECS"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ecs-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb_sg will be created
  + resource "aws_security_group" "lb_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.alb_cloudfront_egress_to_ecs will be created
  + resource "aws_security_group_rule" "alb_cloudfront_egress_to_ecs" {
      + description              = "Egress elb to the ecs/ec2 host"
      + from_port                = 8000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8000
      + type                     = "egress"
    }

  # aws_security_group_rule.alb_cloudfront_https_ingress_only will be created
  + resource "aws_security_group_rule" "alb_cloudfront_https_ingress_only" {
      + description              = "Allow HTTPS access only from CloudFront CIDR blocks"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = [
          + "pl-4fa04526",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PrivateSubnet 1"
        }
      + tags_all                                       = {
          + "AppStackID" = "testApp01"
          + "Name"       = "PrivateSubnet 1"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PrivateSubnet 2"
        }
      + tags_all                                       = {
          + "AppStackID" = "testApp01"
          + "Name"       = "PrivateSubnet 2"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PrivateSubnet 3"
        }
      + tags_all                                       = {
          + "AppStackID" = "testApp01"
          + "Name"       = "PrivateSubnet 3"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PublicSubnet 1"
        }
      + tags_all                                       = {
          + "AppStackID" = "testApp01"
          + "Name"       = "PublicSubnet 1"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PublicSubnet 2"
        }
      + tags_all                                       = {
          + "AppStackID" = "testApp01"
          + "Name"       = "PublicSubnet 2"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "PublicSubnet 3"
        }
      + tags_all                                       = {
          + "AppStackID" = "testApp01"
          + "Name"       = "PublicSubnet 3"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.testApp01-vpc will be created
  + resource "aws_vpc" "testApp01-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "AppStackID" = "testApp01"
          + "Owner"      = "Ben"
          + "OwnerEmail" = "iamben84@gmail.com"
        }
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ecs_cluster_id      = "arn:aws:ecs:eu-west-1:906273274991:cluster/testApp01-ecs-cluster" -> (known after apply)
  ~ ecs_task_definition = "arn:aws:ecs:eu-west-1:906273274991:task-definition/api-task:9" -> (known after apply)
  ~ private_subnet_ids  = [
      ~ "subnet-0a9f778b8c0dc0921" -> (known after apply),
      ~ "subnet-0543a924273051fd6" -> (known after apply),
      ~ "subnet-0bd05d832c02712c0" -> (known after apply),
    ]
  ~ public_subnet_ids   = [
      ~ "subnet-0db2bdb84e5012452" -> (known after apply),
      ~ "subnet-04e869c1db91655a2" -> (known after apply),
      ~ "subnet-06450fd06929c67a7" -> (known after apply),
    ]
  ~ security_group_id   = "sg-0a281f3d64f41fdde" -> (known after apply)
  ~ vpc_id              = "vpc-0594176384ecfe77a" -> (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 3 of 20 estimated
           $35.00080000000000272/mo +$35.00080000000000272

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BenjoGreeno, Action: `pull_request`*